In [1]:
import numpy as np
import pandas as pd

In [2]:
type(None)

NoneType

In [3]:
myArr = np.array([1,None,3,4])
myArr

array([1, None, 3, 4], dtype=object)

In [4]:
myArr.sum()  # None不能参与运算

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [5]:
sum = np.arange(1000,dtype = int).sum()
sum

499500

In [6]:
sum = np.arange(1000,dtype = float).sum()
sum

499500.0

In [7]:
myArr = np.array([1,2,np.nan])
myArr

array([ 1.,  2., nan])

In [8]:
myArr = np.array([1,2,1//0]) 
myArr

ZeroDivisionError: integer division or modulo by zero

In [9]:
myArr.sum()

nan

In [11]:
np.nansum(myArr)  # 忽略nan后，运算

3.0

In [12]:
myArr  = pd.Series([1,2,3,4,5,np.nan,None])
myArr

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    NaN
dtype: float64

In [14]:
type(myArr[1])

numpy.float64

In [16]:
myData = pd.Series([1,2,3,'abc',np.nan,None])
myData

0       1
1       2
2       3
3     abc
4     NaN
5    None
dtype: object

In [17]:
myData.isnull()  # 筛选缺失数据

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [18]:
myData.dropna  # 过略确实数据

0      1
1      2
2      3
3    abc
dtype: object

In [23]:
df = pd.DataFrame([[1,2,3,4,np.nan],[5,6,np.nan,np.nan,np.nan],
                  [51,61,np.nan,np.nan,78],
                   [100,200,300,400,500]])
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [24]:
df.dropna()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [25]:
df.dropna(axis = 0) #行， axis的0，1不固定

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [26]:
df.dropna(axis = 1)   #列

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
    </tr>
  </tbody>
</table>
</div>

In [28]:
df.dropna(axis = 'columns',how = 'any')  # 只要有一个就删除column

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
    </tr>
  </tbody>
</table>
</div>

In [29]:
df.dropna(axis = 'columns',how = 'all')

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>400.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [31]:
data = pd.Series([1,np.nan,2,None,'nimei'],index =list('abcde'))
data

a        1
b      NaN
c        2
d     None
e    nimei
dtype: object

In [32]:
data.fillna(0) # 加法填充0，乘法填充1

a        1
b        0
c        2
d        0
e    nimei
dtype: object

In [33]:
data.fillna(1)

a        1
b        1
c        2
d        1
e    nimei
dtype: object

In [34]:
data.fillna(method = 'ffill') # 取前面一个值填充

a        1
b        1
c        2
d        2
e    nimei
dtype: object

In [36]:
data.fillna(method = 'bfill'  #取后面一个值填充

a        1
b        2
c        2
d    nimei
e    nimei
dtype: object

In [38]:
df = pd.DataFrame([[1,2,3,4,np.nan],[5,6,np.nan,np.nan,np.nan],
                  [51,61,np.nan,np.nan,78],
                   [100,200,300,np.nan,500]])
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>NaN</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [40]:
df.fillna(1)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>1.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>

In [43]:
df.fillna(method= 'ffill',axis = 0) #列，前方没有不填

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>4</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>5</td>
      <td>6</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>51</td>
      <td>61</td>
      <td>3.0</td>
      <td>4.0</td>
      <td>78.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>100</td>
      <td>200</td>
      <td>300.0</td>
      <td>4.0</td>
      <td>500.0</td>
    </tr>
  </tbody>
</table>
</div>